<!--协议弹框-->
<template lang="pug">
  modal-dialog(modal-scale="large")
    .modal-card(slot="card", style="width: 800px; ")
      .modal-header
        .modal-card-title 壳保养智慧门店平台门店入驻协议
        .close-button(@click="modalClose")
      .modal-body(style="padding: 20px; max-height: 440px; overflow-y: auto")
        h2 壳保养智慧门店平台门店入驻协议
        p 本协议由缔约双方在自愿、平等、公平及诚实信用原则的基础上，根据《中华人民共和国合同法》、《消费者权益保护法》等相关法律、法规的规定，经友好协商缔结。
        p 本协议由协议正文、附件及依据本协议公示于“壳保养智慧门店”平台的各项规则所组成，协议附件及规则与本协议具有同等法律效力，如规则与本协议约定不一致的，以公布生效日期或签署日期在后的文件为准执行。
        p 本协议各条的标题仅为方便阅读而设，无意成为本协议的一部分，也不影响本协议的含义或解释。
        h3 第一条 合作方式
        p 1、合作形式
        p 本协议所称合作，指由畅移（上海）信息科技有限公司（以下简称：畅移）所代运营的壳牌（中国）有限公司（以下简称：壳牌）拥有的“壳保养智慧门店”小程序平台,畅移代收货款、由门店提供商品、服务在“壳保养智慧门店”平台展示，同时由门店自行向终端消费者提供商品、售后服务等，双方联合经营的经营模式。
        p （1） “壳保养智慧门店”平台：指由畅移提供技术支持和服务的小程序平台。随着平台服务范围或服务项目的变更，畅移可能在平台规则或公告中对“壳保养智慧门店”平台的范围或域名调整予以声明。
        p （2）消费者：指在“壳保养智慧门店”平台上购买商品的用户。
        p （3）商品：指在“壳保养智慧门店”平台上销售或展示的商品和服务。
        p （4）门店：指在“壳保养智慧门店”平台上出售或提供商品的门店。
        p （5）门店后台：门店在“壳保养智慧门店”平台经畅移审核及完成必要的入驻流程后，由畅移给予门店PC端的门店管理后台网址，包括独立的账号和平台设置的初始密码，门店在该后台完成产品编辑、上传、处理订单、核销等相关事宜。
        p （6）确认交易：指消费者在“壳保养智慧门店”平台向门店购买商品，通过“壳保养智慧门店”平台提供之后台系统付款并确认的交易。
        p （7）平台规则：指在各”壳保养智慧门店”平台上已经发布或将来可能发布的各种规范性文件，包括但不限于《壳保养智慧门店平台门店入驻协议》及其他细则、规范、政策、通知等规范性文件。
        p （8）平台技术服务：以下或称“平台服务”，指畅移依托”壳保养智慧门店”平台向门店提供的服务。主要包括店铺管理、商品发布、浏览、信息交流、商品交易、推广营销以及其他畅移各个平台上所提供的无偿或有偿的技术服务。
        h3 第二条 门店资格要求以及证明文件
        p 1、门店申请及开展店铺经营活动，须持续的同时满足以下基本条件：
        p （1）门店已依照中华人民共和国法律注册并领取合法有效的营业执照及取得其他经营许可，身份信息应为门店自身情况的客观表现；
        p （2）门店所经营的商品来源合法，资质齐全；
        p （3）门店提交的任何信息均真实、合法、有效，所使用的图片、文字等不侵犯任何第三方合法权益；
        p （4）门店签署本协议并同意“壳保养智慧门店”平台规则内容；
        p （5）平台依据国家法律法规、政策或其他规范性文件规定及经营需要可能设定的其他条件。
        p 2、证明文件明细
        p （1）门店应依据平台规则及相应的入驻流程要求完成“壳保养智慧门店”平台的入驻及店铺开设，在线签订“壳保养智慧门店”平台所公示的需要门店签订的相应协议。门店应向平台提交各项为经营店铺所必须的资质、证照、证明或其他相关文件（以下统称“证明文件”），包括但不限于三证合一（营业执照、税务登记证、组织机构代码）、开户行证明、法定代表人身份证正、反面复印件等，门店应向“壳保养智慧门店”平台提交与原件核对一致且加盖门店公章的纸质复印件（根据实际业务提供相应资质）。
        p （2）门店保证上述证明文件发生任何变更或更新时立即通知平台方，并于变更或更新之日起十五个工作日内，提交更新后的文件并依据“壳保养智慧门店”平台实时公布的流程进行相应认证。
        p （3）门店提交虚假、过期文件、或未如期通知并提交更新文件等情形的，由门店独立承担全部法律责任。若由此导致门店的店铺信息不符合“壳保养智慧门店”平台所公示的门店条件的，“壳保养智慧门店”平台有权要求门店补充提供相关资料，或者拒绝门店申请、调整门店权限、直至终止本协议。如门店造成畅移及其他任何第三方损失的，门店还应承担全部责任并足额赔偿。
        h3 第三条 费用以及付款
        p （1）畅移与门店双方以人民币为结算货币。
        p （2）平台默认以门店申请美团支付时提交的账户名称以及账号。
        p （3）“壳保养智慧门店”平台根据双方确认的商品结算价格向门店结算货款。
        p （4）门店使用平台服务，门店同意按照平台标准支付手续费（以微信支付行业费率为准，以下简称“手续费”）。平台将从提供支付服务的款项中实时扣除手续费，手续费的费用为: 0.6%，随微信支付的政策调整有变化的可能，平台暂免收取平台手续费。产品协议对费用及结算另有约定的，以产品协议约定为准。
        p （5）门店需及时向畅移提供平台方要求提供的变更账户相关资料。因门店银行账号变更但未及时通知畅移造成的任何损失均由门店承担。
        p （6）平台、门店双方约定的结算周期以双方签订的服务协议约定30天为准。每月最后一个工作日为结算日，平台、门店双方应进行对账，平台结算当月内已核销的商品或服务货款给门店。具体结算到达门店银行账号的时间取决 于银行系统的清算时长。

        h3 第四条 门店发布内容规范
        p 1、本条所述内容是指门店使用平台的过程中所传播的任何内容，包括但不限于商品说明、服务介绍等信息及认证资料，或文字、语音、图片、视频、图文等发送、回复或自动回复消息和相关链接页面，以及其他使用账号或本服务所产生的内容。
        p 2、用户不得利用本服务传播如下法律、法规和政策禁止的内容:
        p （1）反对宪法所确定的基本原则的；反对宪法所确定的基本原则的；
        p （2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
        p （3）损害国家荣誉和利益的；
        P （4） 煽动民族仇恨、民族歧视，破坏民族团结的；
        P （5）破坏国家宗教政策，宣扬邪教和封建迷信的；
        P （6）散布谣言，扰乱社会秩序，破坏社会稳定的；
        P （7）散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；
        P （8）侮辱或者诽谤他人，侵害他人合法权益的； 
        P （9）含有法律、行政法规禁止的其他内容的信息。
        p 3、门店不得利用平台服务传播如下干扰"平台"正常运营，以及侵犯其他用户或第三方合法权益的内容：
        p （1）含有任何性或性暗示的；
        p （2）含有辱骂、恐吓、威胁内容的；
        p （3）含有骚扰、垃圾广告、恶意信息、诱骗信息的；
        p （4）涉及他人隐私、个人信息或资料的；
        p （5）侵害他人名誉权、肖像权、知识产权、商业秘密等合法权利的；
        p （6）侵害未成年人合法权益或者损害未成年人身心健康的；
        p （7）含有其他干扰本服务正常运营和侵犯其他用户或第三方合法权益内容的信息。 

        h3 第五条 双方权利义务
        p 1、畅移在现有技术实现基础上努力维护“壳保养智慧门店”平台的正常稳定运行，并努力提升和改进技术，对平台功能及服务进行更新、升级，以不断提升平台性能和交易效率。如发现门店有损系统安全、稳定操作的，畅移有权立即停止为门店继续提供平台服务，并立即删除所有有害信息、数据等；门店应对此导致的一切不利后果承担全部法律责任，包括但不限于赔偿畅移及其关联公司/机构、消费者或其他任何第三方的损失。
        p 2、畅移有权根据“壳保养智慧门店”平台的发展规划自主选择是否对通过资质审核的门店开设店铺，提供平台服务。而未承诺必然对所有申请的门店承诺开通权限；同时有权依据独立判断，不受时间限制的审批门店的申请。
        p 3、畅移有权单方根据国家相关法律法规、政策及“壳保养智慧门店”平台运营情况，对公示于“壳保养智慧门店”平台规则进行变更，变更后的规则平台将以公告形式告知门店，任何变更一经公告即构成本协议的组成部分。
        p 4、畅移有权对门店的申请信息、上传的相关数据信息、在“壳保养智慧门店”平台发布的其他信息、交易行为进行监督检查，对发现的涉嫌违反法律法规、违反平台规则或的信息及其相关内容，门店知晓并同意畅移有权不经通知直接删除，对发现的其他问题或疑问门店发出询问及要求改正的通知，门店应在接到通知后立即做出说明并提供相关证明材料或改正。
        p 5、畅移有权将国家生效法律文书或行政文书确定的门店违法违规事件，或门店已确认的门店违反本协议相关约定的事项，在“壳保养智慧门店”平台上予以公示；门店违规或者有严重违约、违规情形的，畅移有权对其采取限制权限、依据平台规则进行违规处理直至终止本协议等措施，上述措施不足以补偿平台及其关联公司/机构、消费者或其他任何第三方损失的，门店还应足额赔偿。
        p 6、如门店的运营情况不能满足“壳保养智慧门店”平台公布的要求（包括但不限于“壳保养智慧门店”平台规则等），经限期整改调整后，仍无法满足的，畅移有权解除本协议，停止向门店提供服务。
        p 7、门店有义务对其在“壳保养智慧门店”平台销售的每款商品按照国家标准，行业标准及平台发布的各品类商品要求进行质量控制（包括且不仅限于商品法律法规符合性，商品安全性，商品功能材质与描述符合性，商品标识标示，商品外观，商品包装等），并依照国家法律法规提供售后三包服务。畅移有权根据市场反馈自行或委托第三方质检机构进行不定期商品抽检（检测项目包括且不仅限于门店销售商品的性能，质量，材料成分，是否符合国家法律法规要求等各方面；抽检方式包括但不限于匿名购买、对于门店订单信息及页面信息进行检查等），或要求门店对平台指定商品提供进货凭证，出厂检验报告或者第三方质检机构出具的检测报告等相关商品及批次的质量合格证明文件。如果门店所销售商品抽检不合格或无法向平台提供相关商品及批次质量合格的证明文件，畅移有权根据本协议及“壳保养智慧门店”平台所公示的平台规则，规范及标准，并且依据问题的严重程度对门店提出相应的限期整改要求、进行违规处理以及追究相应的违约责任。
        p 8、畅移有权要求门店提供与门店商品、售后服务等相关的信息，以便于消费者直接向“壳保养智慧门店”平台进行咨询时予以回复，对于平台无法回答或属门店掌握的情况，畅移有权要求门店在指定的时限内予以回复或给出相应方案，如门店未及时予以解决的客户咨询及投诉，畅移有权对门店采取相应处理措施。
        p 9、门店同意畅移根据门店营业执照所载明的经营范围及门店申请的经营类目，核实及调整门店在“壳保养智慧门店”平台经营的具体商品的种类、数量和类目范围。
        p 10、核销后门店与用户就商品和/或服务是否交付、交付质量存在争议的，平台仅有协调义务，门店仍有未完成服务或未交付商品的，门店有义务完成履行，如因门店商品、发布的信息或提供的售后服务问题而引发客户对平台及其关联公司/机构的诉讼平台及其关联公司/机构有权披露门店为实际商品提供商，门店应承担因诉讼而产生的全部法律责任，如因此而给畅移及其关联公司/机构造成损失的，畅移有权要求门店赔偿畅移及其关联公司/机构的全部损失。
        p 11、门店同意并授权平台代收消费者货款，同时同意并授权平台以畅移名义指令第三方支付机构将消费者支付货款转账至畅移指定支付账户中，依据双方共同确认的结算流程，自消费者到店完成服务后，平台当月最后一个工作日进行当月货款清算。
        p 12、双方确认，如门店违反本协议，且经畅移书面或电子数据形式催告后三个工作日内仍未采取有效措施完成补救，畅移有权暂缓支付未结算款项。
        p 13、门店有义务按照消费者实际支付的金额为消费者开具发票，相关税收应按国家相关规定由门店自行承担，平台不承担开票义务。
        p 14、未核销的订单，消费者可在30天内申请退款，由畅移原路退款给消费者，超过30天后由门店负责消费者的退款，门店可按消费者实际付款金额扣除0.6%的手续费退款给消费者，平台当月底按正常核销订单与门店进行清算。如果已核销订单，消费者有退款等售后问题，由门店承担。
        h3 第六条 保密义务
        p 1、一方对于本协议的签订、内容及在履行本协议期间所获知的其他方的商业秘密负有保密义务。非经相对方书面同意，不得向相对方以外的任何第三方（关联公司除外）泄露、给予或转让该等保密信息。根据法律法规、证券交易所规则向政府、证券交易所和/或其他监管机构提供、协议方的法律、会计、商业及其他顾问、雇员除外）。
        p 2、如相对方提出要求，任何一方均应将载有相对方单独所有的保密信息的任何文件、资料或软件等，在本协议终止后按对方要求归还对方，或予以销毁，或进行其他处置，并且不得继续使用这些保密信息。
        p 3、在本协议终止之后，各方在本条款项下的义务并不随之终止，各方仍需遵守本协议之保密条款，履行其所承诺的保密义务，直到其他方同意其解除此项义务，或事实上不会因违反本协议的保密条款而给其他方造成任何形式的损害时为止。
        p 4、任何一方均应告知并督促其因履行本协议之目的而必须获知本协议内容及因合作而获知对方商业秘密的雇员、代理人、顾问等遵守保密条款，并对其雇员、代理人、顾问等的行为承担责任。
        h3 第七条 违约责任
        p 1、门店的经营导致纠纷或政府部门查处的，门店应按平台的要求提供相应的证明材料，必要时，应自行或由畅移协助或授权畅移及/或其关联公司/机构处理解决。由此导致的畅移及/或其关联公司/机构损失（损失包括但不限于诉讼费、律师费、赔偿、补偿、行政机关处罚、差旅费等），门店应足额赔偿。
        p 2、门店有销售假冒伪劣商品等侵犯知识产权行为、涉嫌非法信用卡套现等违法活动，并有可能涉嫌违法甚至刑事犯罪的，畅移有权向相应机关（包括但不限于行政监管机关、公安机关、司法机关以及其他有权机关）提供门店一切资料及信息，在“壳保养智慧门店”平台披露门店涉嫌违法及犯罪行为及情况，并配合相应机关的调查取证及侦查工作，门店应承担由此产生的一切责任并赔偿“壳保养智慧门店”平台由此遭受的所有损失。
        p 3、门店违反门店于本协议项下的陈述、承诺、保证和义务，或违反“壳保养智慧门店”平台规则以及门店所在线签订的“壳保养智慧门店”平台所公示的在线协议，均构成对于本协议的违约。如门店发生违约行为，畅移可以本协议约定的通知方式要求门店在指定的时限内停止违约行为，要求其消除影响并依据平台规则对于门店违约行为进行违规处理。门店发生违约情形时，畅移除有权按照本协议约定要求门店承担违约责任外，还有权依据本协议其他约定限制门店权限、扣除保证金（如有）、解除本协议等措施。
        h3 第八条 通知及送达
        p 1、针对门店的服务费用收费标准变更、规则变更、保证金标准、通知等将以“壳保养智慧门店”平台公告形式告知门店，公告一经发布，即视为送达，门店应实时关注公告内容。
        p 2、平台针对某特定门店的通知等，所填写的电子邮箱地址或者门店后台中；如以电子数据形式发送至门店后台的，则平台一经发出即视为送达。
        h3 第九条 争议解决
        p 1、履行本协议过程中产生的任何争议，协议方应协商解决，协商不成的，任一方有权将争议提交上海徐汇区人民法院诉讼解决。
        p 2、本协议的签订、解释、变更、履行及争议的解决等均适用中华人民共和国大陆地区现行有效的法律。
        h3 第十条 其他约定
        p 1、本协议的任何一方未能及时行使本协议项下的权利不应被视为放弃该权利，也不影响该方在将来行使该权利。
        p 2、如果本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，或违反任何适用的法律，则该条款被视为删除，但本协议的其余条款仍应具有法律约束力。
        p 3、本协议是缔约协议方之间关于本协议中提及合作事项的完整的、唯一的协议，本协议取代了任何先前的关于该合作事项的协议和沟通（包括数据电文形式、书面形式和口头形式）。
        p 4、本协议文本以中华人民共和国通用简体汉字版本为准；门店与畅移在线签订的《壳保养智慧门店平台门店入驻协议》为本协议的一部分。
        p 5、本协议自双方盖章之日起生效，壹式贰份，甲乙双方各执壹份，具有同等法律效力。
        h3 第十一条 数据授权
        p 1、门店特此不可撤销地允许畅移将其按照本协议平台取得的商业数据提供给壳牌（中国）有限公司及其关联公司用于合法商业目的，但该等商业数据不得包括门店的任何非公开价格信息、成本信息和其他《反垄断法》规定的竞争性敏感信息。
        p 2、各方应遵守有关个人信息保护的所有适用法律法规。如平台方提供任何个人信息（包括但不限于消费者姓名、性别、手机号、QQ号、微信openid、车牌号码），在传输该等信息之前，平台方对个人信息进行匿名处理；
        p 3、满足个人信息保护相关法律法规要求的关于向第三方传输个人信息的全部条件，确保按照个人信息保护相关法律法规履行本合同。
        h3 第十二条 协议有效期
        p 1、本协议自上述服务开通之日起生效，有效期一年。本协议一式贰份，双方各执壹份，具有同等法律效力。
        p 2、本协议自门店在系统开通之日起生效。如本协议首次和后续历次有效期届满前的一个月内平台、门店双方均未提出书面要求终止协议的，本协议应视为自动延期一年。
        p 3、除非各方另有约定，本协议项下的所有通知应通过“壳保养智慧门店”系统后台传送。各方之间的通知及往来信函应发送至本协议载明的地址或电子邮箱（或收件人提前七个自然日向其他方发出书面通知说明的其他地址或电子邮箱）。
        p 4、平台为门店提供支付服务，并可能根据实际情况签署单独的产品协议或其他协议（“产品协议”）。产品协议均为本协议的有效部分，与本协议具有同等效力，与本协议有效期一致，随本协议终止而终止。本协议与产品协议有冲突的，以产品协议为准。 

      .modal-footer
        button.button.large.primary(@click="complete") 同意
</template>

<script>
import ModalDialog from '@/components/generics/ModalDialog'
import ModalInteractions from '@/mixins/utilities/modalInteractions'

export default {
  name: 'CardOffModal',
  mixins: [ModalInteractions],
  components: {
    ModalDialog,
  },
  props: {
  },
  data () {
    return {
    }
  },
  methods: {
    complete () {
      this.modalResolve('success')
    },
  },
}
</script>

<style scoped lang="stylus">
@import '~@/stylus/mixins.styl'
.service-ticket-wrapper
  line-height 40px
  padding 0 10px
.serivce-main-info-wrapper
  width 290px
  margin-bottom 0
.serivce-main-info-wrapper::before
  border none
.serivce-main-info-wrapper .label
  font-size 14px
.tip-item
  position relative
  min-height 64px
  &::before
    content ''
    display inline-block
    vertical-align top
    margin-right 15px
    width 16px
    height 16px
    background center no-repeat url('~@/assets/icons/info-yellow.svg')
.orderList
  padding-top: 0px
  padding-bottom: 10px
  overflow-y: auto
  height: 215px
  .service-item-detail
    line-height: 40px
    height: 40px
  .content
    border-bottom: 1px solid #f0f0f0
    padding: 5px 0
    .price-info
      line-height 40px
      border-left: none
  .content:last-child
    border-bottom: none
h2
  line-height 50px
  text-align center
  font-weight bold
  font-size 16px
h3
  line-height 50px
  font-weight bold
  font-size 14px
h4
  line-height 30px
  font-weight bold
  font-size 14px
p
  text-indent 20px
  line-height 1.3
  padding-bottom 5px
</style>
